## Challenge #35: Data Cleansing Practice

Original challenge: https://community.alteryx.com/t5/Weekly-Challenge/Challenge-35-Data-Cleansing-Practice/td-p/36438

Use Case:  There is a series of data cleansing processes we need to do on our data. Please solve each per the instructions.

In [1]:
import pandas as pd

In [2]:
#read files
df = pd.read_csv(".Challenge 035/challenge_35_input_1.csv", dtype = str)
df2 = pd.read_csv(".Challenge 035/challenge_35_input_2.csv", dtype = str)
df3 = pd.read_csv(".Challenge 035/challenge_35_input_3.csv", dtype = str)
df4 = pd.read_csv(".Challenge 035/challenge_35_input_4.csv", dtype = str)

## Brief 1
Remove leading zeroes

In [76]:
df

      Field1
0      01234
1       1234
2     001234
3  000001234

In [26]:
#replace 0s
df["Field1"] = df["Field1"].str.replace("0", "")
df

  Field1
0   1234
1   1234
2   1234
3   1234

## Brief 2
Trim leading zeroes and/or descriptive text at the end

In [27]:
df2

         Field1
0        001001
1  1001: Report
2      00123456
3          1234

In [28]:
df2["Field1"] = df2["Field1"].str.replace(": Report", "")

In [31]:
#remove 0s from the left
df2["Field1"] = df2["Field1"].str.lstrip("0")
df2

   Field1
0    1001
1    1001
2  123456
3    1234

## Brief 3
If the data value ends with ID, remove the ID

In [37]:
df3

              ID
0  91283091283ID
1           1923
2   1513511324ID
3      ID2454542
4       134ID245

In [38]:
#remove ID from the right
df3["ID"] = df3["ID"].str.rstrip("ID")
df3

            ID
0  91283091283
1         1923
2   1513511324
3    ID2454542
4     134ID245

## Brief 4
If more than 8 chars, remove anything after 8. If only 6, add “SC” to the front.

In [71]:
df4

              Safety Code
0                  C11103
1                SCC11103
2  SCC11103: Fire Warning

In [72]:
#truncate string to 8 characters
df4["Safety Code"] = df4["Safety Code"].str.slice(0,8)
df4

  Safety Code
0      C11103
1    SCC11103
2    SCC11103

In [73]:
#add SC to the left pf the string if the string is 6 characters long
df4["Safety Code"] = df4["Safety Code"].apply(lambda sc:"SC" + sc if len(sc) == 6 else sc)
df4

  Safety Code
0    SCC11103
1    SCC11103
2    SCC11103